#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Попытка
		ЗаполнитьТаблицу();
	Исключение
		Текст = "Ошибка формы должностных инструкций: " + ОписаниеОшибки();
		ЗаписьЖурналаРегистрации("АИС.ДолжностныеИнструкции", УровеньЖурналаРегистрации.Ошибка,,, Текст);
		Сообщить(Текст);
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьТекстНаСервере(0);
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаИнструкцийПриАктивизацииСтроки(Элемент)
	УстановитьТекстНаСервере(Элемент.ТекущаяСтрока);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТаблицу()
	ТаблицаИнструкций.Очистить();

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Документы.АИС_Должность.Наименование КАК Должность,
	|	Документы.Заголовок КАК Заголовок,
	|	Документы.Содержание КАК Текст
	|ИЗ
	|	Справочник.ВнутренниеДокументы КАК Документы
	|ГДЕ
	|	Документы.ВидДокумента.Наименование = ""Должностная инструкция""
	|	И НЕ Документы.ПометкаУдаления
	|УПОРЯДОЧИТЬ ПО
	|	Документы.АИС_Должность.Наименование,
	|	Документы.Заголовок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Строка = ТаблицаИнструкций.Добавить();
		Строка.Должность = Выборка.Должность;
		Строка.Заголовок = Выборка.Заголовок;
		Строка.Текст = Выборка.Текст;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УстановитьТекстНаСервере(Индекс)
	Если ТекстДокумента = Неопределено Тогда
		ТекстДокумента = Новый ТекстовыйДокумент;
	КонецЕсли;
	Если Индекс < 0 Или Индекс >= ТаблицаИнструкций.Количество() Тогда
		ТекстДокумента.УстановитьТекст("");
	Иначе
		ТекстДокумента.УстановитьТекст(ТаблицаИнструкций[Индекс].Текст);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
